{
  "_class_name": "AutoencoderDC",
  "_diffusers_version": "0.32.2",
  "attention_head_dim": 32,
  "decoder_act_fns": "silu",
  "decoder_block_out_channels": [
    128,
    256,
    512,
    512,
    1024
  ],
  "decoder_block_types": [
    "ResBlock",
    "ResBlock",
    "ResBlock",
    "ResBlock",
    "ResBlock",
    "ResBlock"
  ],
  "decoder_layers_per_block": [
    3,
    3,
    3,
    3,
    3
  ],
  "decoder_norm_types": "rms_norm",
  "decoder_qkv_multiscales": [
    [],
    [],
    [],
    [],
    []
  ],
  "downsample_block_type": "Conv",
  "encoder_block_out_channels": [
    128,
    256,
    512,
    512,
    1024
  ],
  "encoder_block_types": [
    "ResBlock",
    "ResBlock",
    "ResBlock",
    "ResBlock",
    "ResBlock"
  ],
  "encoder_layers_per_block": [
    2,
    2,
    2,
    3,
    3
  ],
  "encoder_qkv_multiscales": [
    [],
    [],
    [],
    [],
    []
  ],
  "in_channels": 1,
  "latent_channels": 16,
  "scaling_factor": null,
  "upsample_block_type": "interpolate"
}